import { getRandom } from "./utils.js";

export const Wisdoms = [
    {
        text: 'Якщо ваш внутрішній голос каже, що ви не можете малювати – малюйте якомога більше, тоді цей голос затихне.',
        author: 'Вінсент Ван Гог',
    },
    {
        text: 'Цікавий парадокс полягає в тому, що, коли я сприймаю самого себе таким, який я є, я набуваю можливість змінитися.',
        author: 'Карл Роджерс',
    },
    {
        text: 'У кожної людини є бажання, які вона не повідомляє іншим, і бажання, в яких вона не зізнається навіть собі самому.',
        author: 'Зигмунд Фрейд',
    },
    {
        text: 'Любов до батьків – основа всіх чеснот.',
        author: 'Цицерон',
    },

    {
        text: 'Деякі речі можуть заволодіти вашою увагою, але краще зосередьтеся на тих, які заволодівають вашим серцем',
        author: 'Індійська мудрість',
    },

    {
        text: 'Нам ніщо так не хочеться змінити, як звички інших.',
        author: 'Марк Твен',
    },
    {
        text: 'Любов – така ж опора душі, як ноги для тіла.',
        author: 'К. фон Сієна',
    },
    {
        text: 'Чим бездоганніша  людина зовні, тим більше демонів у неї всередині.',
        author: 'Зігмунд Фрейд',
    },
    {
        text: 'Ми знаходимо в житті лише те, що самі вкладаємо в нього.',
        author: 'Ральф Уолдо Емерсон',
    },

    {
        text: 'Коли я звільняюся від того, хто я є, я стаю тим, ким я можу бути”',
        author: 'Лао Цзи',
    },
    {
        text: 'Найбільший банкрут у цьому світі людина, котра втратила свій життєвий ентузіазм.',
        author: 'Метью Арнолд',
    },
    {
        text: 'Любов і робота – це наріжні камені нашої людяності.',
        author: 'Зигмунд Фрейд',
    },
    {
        text: 'Психолог – це не той, хто знає відповіді на питання, а той, хто знає, як їх шукати.',
        author: 'Дмитро Леонтьєв',
    },
    {
        text: 'Одна з причин існування психотерапії в тому, що сповідаючись незнайомій людині, відкриваєш свободу бути самим собою. Завдяки тому, що ризикнув показати себе комусь, стає легше показати себе самому собі.',
        author: 'Карл Вітакер',
    },
    {
        text: 'Невроз – це нездатність переносити невизначеність.',
        author: 'Зигмунд Фрейд )',
    },
    {
        text: 'Доля людини визначається тим, що відбувається в її голові, коли вона  вступає в протиріччя з зовнішнім світом..',
        author: 'Ерік Берн',
    },
    {
        text: 'Ми повинні вивчити, які риси або якості навколишніх викликають у нас невдоволення або заздрість, і визнати наявність цих якостей у себе. Так ми зможемо перестати заздрити іншим і злитися на них за те, чого не зробили самі.',
        author: 'Джеймс Холліс',
    },
    {
        text: 'Кожна грубість починається зі слабкості.',
        author: 'Сенека',
    },
    {
        text: 'Хоч якою темною була би ніч, неодмінно настане ранок.',
        author: 'Нізамі',
    },
    {
        text: 'Для того, щоб прийти до справжнього знання, треба спочатку відчути сумніви.',
        author: 'Арістотель',
    },
    {
        text: 'Терпіння – це дерево, корені якого – гіркі, а плоди – дуже солодкі.',
        author: 'Перське прислів′я',
    },
    {
        text: 'Через 20 років ви будете більше розчаровані тими речами, які ви не робили, ніж тими, які ви зробили. Тому відчальте від тихої пристані. Відчуйте попутний вітер у вашому вітрилі. Рухайтеся вперед, дійте, відкривайте!.',
        author: 'Марк Твен',
    },
    {
        text: 'Неосмислене життя не варте того, щоб його прожити.',
        author: 'Сократ',
    },
    {
        text: 'Наука – це організовані знання, мудрість – це організоване життя.',
        author: 'Іммануїл Кант',
    },
    {
        text: 'Ви ніколи не перетнете океан, якщо не наберетеся мужності втратити берег з виду.',
        author: 'Христофор Колумб',
    },
    {
        text: 'Свобода нічого не варта, якщо вона не включає в себе свободу помилятися.',
        author: 'Махатма Ганді',
    },
    {
        text: 'Якщо ви думаєте, що ви здатні на щось, ви маєте рацію, якщо ви думаєте, що у вас не вийде щось, ви теж маєте рацію.',
        author: 'Генрі Форд',
    },

    {
        text: 'Недостатньо тільки отримати знання; їх треба застосувати. Недостатньо тільки бажати; треба діяти.',
        author: 'Йоганн Вольфганг фон Гете',
    },

    {
        text: 'Два найважливіших дні у твоєму житті: день, коли ти з’явився на світ, і день, коли ти зрозумів навіщо.',
        author: 'Марк Твен',
    },

    {
        text: 'Найчастіше говорять, що мотивації вистачає ненадовго. Але те ж саме відбувається і з освіжаючим душем, тому і рекомендують його приймати щодня.',
        author: 'Зіг Зіглар',
    },

    {
        text: 'Є тільки один спосіб уникнути критики: нічого не робіть, нічого не говоріть і будьте ніким.',
        author: 'Аристотель',
    },

    {
        text: 'Людина, якою вам судилося стати – це тільки та людина, якою ви самі вирішите стати.',
        author: 'Ральф Голдо Емерсон',
    },

    {
        text: 'Сподіваюся, що в кінці своїх днів, коли я постану перед Богом, у мене не залишиться ні краплі таланту, щоб я могла сказати йому: “Я використала все, що ти дав мені”',
        author: 'Ерма Бомбек',
    },

    {
        text: 'Не варто звинувачувати дитину в тому, що вона боїться темряви. Справжня трагедія – це коли доросла людина боїться світла.',
        author: 'Платон',
    },

    {
        text: 'Варто тільки повірити, що ви можете – і ви вже на півдороги до цілі.',
        author: 'Теодор Рузвельт',
    },

    {
        text: 'Почніть звідти, де ви зараз перебуваєте. Використовуйте те, що у вас є і робіть все, що можете.',
        author: 'Артур Еш',
    },

    {
        text: 'Впади сім разів, піднімися вісім',
        author: 'Японська приказка',
    },

    {
        text: 'Коли одні двері щастя закриваються, відкриваються інші, але ми часто не помічаємо їх, втупившись поглядом у зачинені двері.',
        author: 'Гелен Келлер',
    },

    {
        text: 'У всьому є своя краса, але не кожен може її побачити',
        author: 'Конфуцій',
    },

    {
        text: 'Як добре, що не потрібно чекати ні хвилини, щоб почати робити світ кращим',
        author: 'Анна Франк',
    },

    {
        text: 'Щастя – це не щось готове. Щастя залежить тільки від ваших дій.',
        author: 'Далай Лама',
    },

    {
        text: 'Якщо немає вітру, беріться за весла.',
        author: 'Латинська приказка',
    },

    {
        text: 'Успіх – це здатність крокувати від однієї невдачі до іншої, не втрачаючи ентузіазму.',
        author: 'Вінстон Черчилль',
    },

    {
        text: 'Важливо вірити, що талант нам дається не просто так – і що за будь-яку ціну його потрібно для чогось використовувати.',
        author: 'Марія Склодовська-Кюрі',
    },

    {
        text: 'Важливо вірити, що талант нам дається не просто так – і що за будь-яку ціну його потрібно для чогось використовувати.',
        author: 'Марія Склодовська-Кюрі',
    },
]

const getWisdomTemplate = ({ text, author }) => {
    const templates = [
        `Якось ${author} сказав: ${text}`,
        `${text} \nТак думав ${author}`,
        `Тримай мудрість від ${author} !\n${text}`,
        `${text} \nby ${author}`,
        `Мудрість ${author} \n  ${text}`,
        `${text} \n${author} \n\nЩо думаєш? Як тобі? Це Ярослав питає, якщо можешь напиши йому)`,
        `Трохи їжі для розуму... \n${text} \n${author}`,
        `Хм... Я згадую що ${author} казав : \n${text}`,
        `${text} \n\nЯк думаєш хто це? сказав? \nА це ${author}`,
        `${text} \n\n${author} \n\nТобі відкликається?`,
        `${text} \n\n${author} \n\nПоділишся з Ярославом?`,
    ]

    return getRandom(templates);
}
export const getWisdom = (index) => {
    const wisdom = Wisdoms[index];
    return getWisdomTemplate(wisdom);
}
